# pivot tablolar

In [2]:
import pandas as pd
import seaborn as sns

In [4]:
titanic=sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
titanic.groupby("sex")["survived"].mean()

sex
female    0.742038
male      0.188908
Name: survived, dtype: float64

In [6]:
titanic.groupby("sex")[["survived"]].mean()

        survived
sex
female  0.742038
male    0.188908

In [19]:
titanic.groupby(["sex","class"])["survived"].aggregate("mean")

sex     class
female  First     0.968085
        Second    0.921053
        Third     0.500000
male    First     0.368852
        Second    0.157407
        Third     0.135447
Name: survived, dtype: float64

In [11]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean")

               survived
sex    class
female First   0.968085
       Second  0.921053
       Third   0.500000
male   First   0.368852
       Second  0.157407
       Third   0.135447

In [12]:
titanic.groupby(["sex","class"])[["survived"]].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [13]:
# pivot ile tablo

In [14]:
titanic.pivot_table("survived",index="sex", columns=["class"])

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [15]:
titanic["age"].head(10)

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: age, dtype: float64

In [16]:
age=pd.cut(titanic["age"],[0,25,90])

In [17]:
age.head(10)

0     (0.0, 25.0]
1    (25.0, 90.0]
2    (25.0, 90.0]
3    (25.0, 90.0]
4    (25.0, 90.0]
5             NaN
6    (25.0, 90.0]
7     (0.0, 25.0]
8    (25.0, 90.0]
9     (0.0, 25.0]
Name: age, dtype: category
Categories (2, interval[int64, right]): [(0, 25] < (25, 90]]

In [18]:
titanic.pivot_table("survived",["sex",age], "class")

class               First    Second     Third
sex    age
female (0, 25]   0.928571  0.965517  0.507692
       (25, 90]  0.982456  0.888889  0.378378
male   (0, 25]   0.500000  0.277778  0.155039
       (25, 90]  0.379310  0.079365  0.145161